Verified locally:

Injected bin by adding a .terraform/terraformrc
with the following contents:
```
provider_installation {
  dev_overrides {
    "rancher/rke" = "~/go/src/github.com/rancher/terraform-provider-rke/bin"
  }
}
```
then setting the environment variable:
`TF_CLI_CONFIG_FILE=~/go/src/github.com/rancher/terraform-provider-rke/.terraform/terrarfomrc`

I generated an Ubuntu 24 server and installed Docker, then got rke running on it.
Once RKE was running I generated the cluster with Terraform, then modified the template to add the enable_br_netfilter.
```
resource "rke_cluster" "cluster" {
  nodes {
    address = "<my IP>"
    user    = "<my username>"
    role    = ["controlplane", "worker", "etcd"]
    ssh_key = file("~/.ssh/id_ed25519")
  }
  enable_cri_dockerd = true
  services {
    etcd {
      extra_args = {
        "experimental-peer-skip-client-san-verification" = true
      }
    }
  }
  network {
    enable_br_netfilter = true
  }
}

```

Here is the result of applying the updated template:
```
Terraform will perform the following actions:

  # rke_cluster.cluster will be updated in-place
  ~ resource "rke_cluster" "cluster" {
      ~ cluster_cidr              = "10.42.0.0/16" -> (known after apply)
      ~ cluster_dns_server        = "10.43.0.10" -> (known after apply)
      ~ cluster_domain            = "cluster.local" -> (known after apply)
        id                        = "0d69bcdc-5d5f-4b0a-8212-e540837fa5e4"
      ~ kube_config_yaml          = (sensitive value)
      ~ rke_cluster_yaml          = (sensitive value)
      ~ rke_state                 = (sensitive value)
        # (20 unchanged attributes hidden)

      + network {
          + enable_br_netfilter = true
          + mtu                 = 0
          + options             = (known after apply)
          + plugin              = "canal"
        }

      ~ services {
          ~ etcd {
              ~ extra_args    = {
                  - "election-timeout"                               = "5000" -> null
                  - "heartbeat-interval"                             = "500" -> null
                    # (1 unchanged element hidden)
                }
                # (9 unchanged attributes hidden)
            }

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

rke_cluster.cluster: Modifying... [id=0d69bcdc-5d5f-4b0a-8212-e540837fa5e4]
rke_cluster.cluster: Still modifying... [id=0d69bcdc-5d5f-4b0a-8212-e540837fa5e4, 10s elapsed]
rke_cluster.cluster: Still modifying... [id=0d69bcdc-5d5f-4b0a-8212-e540837fa5e4, 20s elapsed]
rke_cluster.cluster: Still modifying... [id=0d69bcdc-5d5f-4b0a-8212-e540837fa5e4, 30s elapsed]
rke_cluster.cluster: Modifications complete after 31s [id=0d69bcdc-5d5f-4b0a-8212-e540837fa5e4]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
rancher/minimal [update-1.7.5 !?] 
```